bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
            <register>
               <name>PLLSAICFGR</name>
               <displayName>PLLSAICFGR</displayName>
               <description>PLL configuration register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>PLLSAIN</name>
                     <description>PLLSAI division factor for               VCO</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIP</name>
                     <description>PLLSAI division factor for 48MHz               clock</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIQ</name>
                     <description>PLLSAI division factor for SAI               clock</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIR</name>
                     <description>PLLSAI division factor for LCD               clock</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DKCFGR1</name>
               <displayName>DKCFGR1</displayName>
               <description>dedicated clocks configuration           register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>PLLI2SDIV</name>
                     <description>PLLI2S division factor for SAI1               clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIDIVQ</name>
                     <description>PLLSAI division factor for SAI1               clock</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PLLSAIDIVR</name>
                     <description>division factor for               LCD_CLK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SAI1SEL</name>
                     <description>SAI1 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SAI2SEL</name>
                     <description>SAI2 clock source               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TIMPRE</name>
                     <description>Timers clocks prescalers               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DKCFGR2</name>
               <displayName>DKCFGR2</displayName>
               <description>dedicated clocks configuration           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20003000</resetValue>
               <fields>
                  <field>
                     <name>USART1SEL</name>
                     <description>USART 1 clock source               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL</name>
                     <description>USART 2 clock source               selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART3SEL</name>
                     <description>USART 3 clock source               selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART4SEL</name>
                     <description>UART 4 clock source               selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART5SEL</name>
                     <description>UART 5 clock source               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART6SEL</name>
                     <description>USART 6 clock source               selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART7SEL</name>
                     <description>UART 7 clock source               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UART8SEL</name>
                     <description>UART 8 clock source               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL</name>
                     <description>I2C1 clock source               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SEL</name>
                     <description>I2C2 clock source               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL</name>
                     <description>I2C3 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C4SEL</name>
                     <description>I2C4 clock source               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL</name>
                     <description>Low power timer 1 clock source               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CECSEL</name>
                     <description>HDMI-CEC clock source               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CK48MSEL</name>
                     <description>48MHz clock source               selection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDMMCSEL</name>
                     <description>SDMMC clock source               selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
