bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="CAN1">
         <name>CAN2</name>
         <baseAddress>0x40006800</baseAddress>
         <interrupt>
            <name>CAN2_TX</name>
            <description>CAN2 TX interrupts</description>
            <value>63</value>
         </interrupt>
         <interrupt>
            <name>CAN2_RX0</name>
            <description>CAN2 RX0 interrupts</description>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>CAN2_RX1</name>
            <description>CAN2 RX1 interrupts</description>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>CAN2_SCE</name>
            <description>CAN2 SCE interrupt</description>
            <value>66</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="CAN1">
         <name>CAN3</name>
         <baseAddress>0x40003400</baseAddress>
         <interrupt>
            <name>CAN3_TX</name>
            <description>CAN3 TX interrupt</description>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>CAN3_RX0</name>
            <description>CAN3 RX0 interrupt</description>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>CAN3_RX1</name>
            <description>CAN3 RX1 interrupt</description>
            <value>106</value>
         </interrupt>
         <interrupt>
            <name>CAN3_SCE</name>
            <description>CAN3 SCE interrupt</description>
            <value>107</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>Flash</name>
         <description>FLASH</description>
         <groupName>FLASH</groupName>
         <baseAddress>0x40023C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLASH</name>
            <description>Flash global interrupt</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>ACR</name>
               <displayName>ACR</displayName>
               <description>Flash access control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>Latency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRFTEN</name>
                     <description>Prefetch enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARTEN</name>
                     <description>ART Accelerator Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARTRST</name>
                     <description>ART Accelerator reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEYR</name>
               <displayName>KEYR</displayName>
               <description>Flash key register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>FPEC key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTKEYR</name>
               <displayName>OPTKEYR</displayName>
               <description>Flash option key register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPTKEY</name>
                     <description>Option byte key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EOP</name>
                     <description>End of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>Operation error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WRPERR</name>
                     <description>Write protection error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGAERR</name>
                     <description>Programming alignment               error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PGPERR</name>
                     <description>Programming parallelism               error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ERSERR</name>
                     <description>Programming sequence error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Programming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER</name>
                     <description>Sector Erase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MER1</name>
                     <description>Mass Erase of sectors 0 to               11</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SNB</name>
                     <description>Sector number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PSIZE</name>
                     <description>Program size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MER2</name>
                     <description>Mass Erase of sectors 12 to               23</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STRT</name>
                     <description>Start</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOPIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTCR</name>
               <displayName>OPTCR</displayName>
               <description>Flash option control register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFAAED</resetValue>
               <fields>
                  <field>
                     <name>OPTLOCK</name>
                     <description>Option lock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTSTRT</name>
                     <description>Option start</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOR_LEV</name>
                     <description>BOR reset Level</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>WWDG_SW</name>
                     <description>User option bytes</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_SW</name>
                     <description>User option bytes</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STOP</name>
                     <description>User option bytes</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STDBY</name>
                     <description>User option bytes</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDP</name>
                     <description>Read protect</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>nWRP</name>
                     <description>Not write protect</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>nDBOOT</name>
                     <description>Dual Boot mode (valid only when               nDBANK=0)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nDBANK</name>
                     <description>Not dual bank mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STDBY</name>
                     <description>Independent watchdog counter freeze in               standby mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STOP</name>
                     <description>Independent watchdog counter freeze in               Stop mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPTCR1</name>
               <displayName>OPTCR1</displayName>
               <description>Flash option control register           1</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>BOOT_ADD0</name>
                     <description>Boot base address when Boot pin               =0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BOOT_ADD1</name>
                     <description>Boot base address when Boot pin               =1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
