bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
            <register>
               <name>DFSDM3_CR2</name>
               <displayName>DFSDM3_CR2</displayName>
               <description>DFSDM control register 2</description>
               <addressOffset>0x384</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JEOCIE</name>
                     <description>Injected end of conversion interrupt               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCIE</name>
                     <description>Regular end of conversion interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRIE</name>
                     <description>Injected data overrun interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRIE</name>
                     <description>Regular data overrun interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDIE</name>
                     <description>Analog watchdog interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCDIE</name>
                     <description>Short-circuit detector interrupt               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABIE</name>
                     <description>Clock absence interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXCH</name>
                     <description>Extremes detector channel               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH</name>
                     <description>Analog watchdog channel               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_ISR</name>
               <displayName>DFSDM0_ISR</displayName>
               <description>DFSDM interrupt and status           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>JEOCF</name>
                     <description>End of injected conversion               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCF</name>
                     <description>End of regular conversion               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRF</name>
                     <description>Injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRF</name>
                     <description>Regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDF</name>
                     <description>Analog watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JCIP</name>
                     <description>Injected conversion in progress               status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCIP</name>
                     <description>Regular conversion in progress               status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABF</name>
                     <description>Clock absence flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SCDF</name>
                     <description>short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_ISR</name>
               <displayName>DFSDM1_ISR</displayName>
               <description>DFSDM interrupt and status           register</description>
               <addressOffset>0x188</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>JEOCF</name>
                     <description>End of injected conversion               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCF</name>
                     <description>End of regular conversion               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRF</name>
                     <description>Injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRF</name>
                     <description>Regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDF</name>
                     <description>Analog watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JCIP</name>
                     <description>Injected conversion in progress               status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCIP</name>
                     <description>Regular conversion in progress               status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABF</name>
                     <description>Clock absence flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SCDF</name>
                     <description>short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_ISR</name>
               <displayName>DFSDM2_ISR</displayName>
               <description>DFSDM interrupt and status           register</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>JEOCF</name>
                     <description>End of injected conversion               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCF</name>
                     <description>End of regular conversion               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRF</name>
                     <description>Injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRF</name>
                     <description>Regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDF</name>
                     <description>Analog watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JCIP</name>
                     <description>Injected conversion in progress               status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCIP</name>
                     <description>Regular conversion in progress               status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABF</name>
                     <description>Clock absence flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SCDF</name>
                     <description>short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_ISR</name>
               <displayName>DFSDM3_ISR</displayName>
               <description>DFSDM interrupt and status           register</description>
               <addressOffset>0x388</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>JEOCF</name>
                     <description>End of injected conversion               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REOCF</name>
                     <description>End of regular conversion               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JOVRF</name>
                     <description>Injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVRF</name>
                     <description>Regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDF</name>
                     <description>Analog watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JCIP</name>
                     <description>Injected conversion in progress               status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCIP</name>
                     <description>Regular conversion in progress               status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKABF</name>
                     <description>Clock absence flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SCDF</name>
                     <description>short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_ICR</name>
               <displayName>DFSDM0_ICR</displayName>
               <description>DFSDM interrupt flag clear           register</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRJOVRF</name>
                     <description>Clear the injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRROVRF</name>
                     <description>Clear the regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRCKABF</name>
                     <description>Clear the clock absence               flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRSCDF</name>
                     <description>Clear the short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_ICR</name>
               <displayName>DFSDM1_ICR</displayName>
               <description>DFSDM interrupt flag clear           register</description>
               <addressOffset>0x18C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRJOVRF</name>
                     <description>Clear the injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRROVRF</name>
                     <description>Clear the regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRCKABF</name>
                     <description>Clear the clock absence               flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRSCDF</name>
                     <description>Clear the short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_ICR</name>
               <displayName>DFSDM2_ICR</displayName>
               <description>DFSDM interrupt flag clear           register</description>
               <addressOffset>0x20C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRJOVRF</name>
                     <description>Clear the injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRROVRF</name>
                     <description>Clear the regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRCKABF</name>
                     <description>Clear the clock absence               flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRSCDF</name>
                     <description>Clear the short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_ICR</name>
               <displayName>DFSDM3_ICR</displayName>
               <description>DFSDM interrupt flag clear           register</description>
               <addressOffset>0x38C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRJOVRF</name>
                     <description>Clear the injected conversion overrun               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRROVRF</name>
                     <description>Clear the regular conversion overrun               flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRCKABF</name>
                     <description>Clear the clock absence               flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRSCDF</name>
                     <description>Clear the short-circuit detector               flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_JCHGR</name>
               <displayName>DFSDM0_JCHGR</displayName>
               <description>DFSDM injected channel group selection           register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>JCHG</name>
                     <description>Injected channel group               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_JCHGR</name>
               <displayName>DFSDM1_JCHGR</displayName>
               <description>DFSDM injected channel group selection           register</description>
               <addressOffset>0x190</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>JCHG</name>
                     <description>Injected channel group               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_JCHGR</name>
               <displayName>DFSDM2_JCHGR</displayName>
               <description>DFSDM injected channel group selection           register</description>
               <addressOffset>0x210</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>JCHG</name>
                     <description>Injected channel group               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_JCHGR</name>
               <displayName>DFSDM3_JCHGR</displayName>
               <description>DFSDM injected channel group selection           register</description>
               <addressOffset>0x310</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>JCHG</name>
                     <description>Injected channel group               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
