bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
            <register>
               <name>DHTMEM42</name>
               <displayName>DHTMEM42</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x404</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM43</name>
               <displayName>DHTMEM43</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x408</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM44</name>
               <displayName>DHTMEM44</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x40C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM45</name>
               <displayName>DHTMEM45</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x410</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM46</name>
               <displayName>DHTMEM46</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x414</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM47</name>
               <displayName>DHTMEM47</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x418</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM48</name>
               <displayName>DHTMEM48</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x41C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM49</name>
               <displayName>DHTMEM49</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x420</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM50</name>
               <displayName>DHTMEM50</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x424</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM51</name>
               <displayName>DHTMEM51</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x428</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM52</name>
               <displayName>DHTMEM52</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x42C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM53</name>
               <displayName>DHTMEM53</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x430</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM54</name>
               <displayName>DHTMEM54</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x434</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM55</name>
               <displayName>DHTMEM55</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x438</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM56</name>
               <displayName>DHTMEM56</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x43C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM57</name>
               <displayName>DHTMEM57</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x440</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM58</name>
               <displayName>DHTMEM58</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x444</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM59</name>
               <displayName>DHTMEM59</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x448</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM60</name>
               <displayName>DHTMEM60</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x44C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM61</name>
               <displayName>DHTMEM61</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x450</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM62</name>
               <displayName>DHTMEM62</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x454</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM63</name>
               <displayName>DHTMEM63</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x458</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM64</name>
               <displayName>DHTMEM64</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x45C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM65</name>
               <displayName>DHTMEM65</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x460</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM66</name>
               <displayName>DHTMEM66</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x464</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM67</name>
               <displayName>DHTMEM67</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x468</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM68</name>
               <displayName>DHTMEM68</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x46C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM69</name>
               <displayName>DHTMEM69</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x470</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM70</name>
               <displayName>DHTMEM70</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x474</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM71</name>
               <displayName>DHTMEM71</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x478</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM72</name>
               <displayName>DHTMEM72</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x47C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM73</name>
               <displayName>DHTMEM73</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x480</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM74</name>
               <displayName>DHTMEM74</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x484</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM75</name>
               <displayName>DHTMEM75</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x488</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM76</name>
               <displayName>DHTMEM76</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x48C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
