bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
            <register>
               <name>HUFFENC_AC0_41</name>
               <displayName>HUFFENC_AC0_41</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_42</name>
               <displayName>HUFFENC_AC0_42</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5A8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_43</name>
               <displayName>HUFFENC_AC0_43</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5AC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_44</name>
               <displayName>HUFFENC_AC0_44</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5B0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_45</name>
               <displayName>HUFFENC_AC0_45</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5B4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_46</name>
               <displayName>HUFFENC_AC0_46</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5B8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_47</name>
               <displayName>HUFFENC_AC0_47</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5BC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_48</name>
               <displayName>HUFFENC_AC0_48</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5C0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_49</name>
               <displayName>HUFFENC_AC0_49</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5C4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_50</name>
               <displayName>HUFFENC_AC0_50</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5C8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_51</name>
               <displayName>HUFFENC_AC0_51</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5CC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_52</name>
               <displayName>HUFFENC_AC0_52</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5D0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_53</name>
               <displayName>HUFFENC_AC0_53</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5D4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_54</name>
               <displayName>HUFFENC_AC0_54</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5D8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_55</name>
               <displayName>HUFFENC_AC0_55</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_56</name>
               <displayName>HUFFENC_AC0_56</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_57</name>
               <displayName>HUFFENC_AC0_57</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5E4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_58</name>
               <displayName>HUFFENC_AC0_58</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5E8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_59</name>
               <displayName>HUFFENC_AC0_59</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5EC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_60</name>
               <displayName>HUFFENC_AC0_60</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5F0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_61</name>
               <displayName>HUFFENC_AC0_61</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5F4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_62</name>
               <displayName>HUFFENC_AC0_62</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5F8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_63</name>
               <displayName>HUFFENC_AC0_63</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x5FC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_64</name>
               <displayName>HUFFENC_AC0_64</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x600</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_65</name>
               <displayName>HUFFENC_AC0_65</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x604</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_66</name>
               <displayName>HUFFENC_AC0_66</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x608</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_67</name>
               <displayName>HUFFENC_AC0_67</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x60C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_68</name>
               <displayName>HUFFENC_AC0_68</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x610</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_69</name>
               <displayName>HUFFENC_AC0_69</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x614</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_70</name>
               <displayName>HUFFENC_AC0_70</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x618</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_71</name>
               <displayName>HUFFENC_AC0_71</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x61C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_72</name>
               <displayName>HUFFENC_AC0_72</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x620</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_73</name>
               <displayName>HUFFENC_AC0_73</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x624</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
