bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
            <register>
               <name>OTG_HS_DOEPINT7</name>
               <displayName>OTG_HS_DOEPINT7</displayName>
               <description>OTG_HS device endpoint-7 interrupt           register</description>
               <addressOffset>0x3E8</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed               interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>Endpoint disabled               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>SETUP phase done</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OUT token received when endpoint               disabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets               received</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>NYET interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ0</name>
               <displayName>OTG_HS_DOEPTSIZ0</displayName>
               <description>OTG_HS device endpoint-0 transfer size           register</description>
               <addressOffset>0x310</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUPCNT</name>
                     <description>SETUP packet count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ1</name>
               <displayName>OTG_HS_DOEPTSIZ1</displayName>
               <description>OTG_HS device endpoint-1 transfer size           register</description>
               <addressOffset>0x330</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ2</name>
               <displayName>OTG_HS_DOEPTSIZ2</displayName>
               <description>OTG_HS device endpoint-2 transfer size           register</description>
               <addressOffset>0x350</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ3</name>
               <displayName>OTG_HS_DOEPTSIZ3</displayName>
               <description>OTG_HS device endpoint-3 transfer size           register</description>
               <addressOffset>0x370</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ4</name>
               <displayName>OTG_HS_DOEPTSIZ4</displayName>
               <description>OTG_HS device endpoint-4 transfer size           register</description>
               <addressOffset>0x390</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ6</name>
               <displayName>OTG_HS_DIEPTSIZ6</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <alternateRegister>OTG_HS_DIEPCTL5</alternateRegister>
               <addressOffset>0x1A0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS6</name>
               <displayName>OTG_HS_DTXFSTS6</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x1A4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ7</name>
               <displayName>OTG_HS_DIEPTSIZ7</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <alternateRegister>OTG_HS_DIEPINT5</alternateRegister>
               <addressOffset>0x1A8</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS7</name>
               <displayName>OTG_HS_DTXFSTS7</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x1AC</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL4</name>
               <displayName>OTG_HS_DOEPCTL4</displayName>
               <description>OTG device endpoint-4 control           register</description>
               <addressOffset>0x380</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL5</name>
               <displayName>OTG_HS_DOEPCTL5</displayName>
               <description>OTG device endpoint-5 control           register</description>
               <addressOffset>0x3A0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
