bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x7.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OTG_HS_PWRCLK</name>
         <description>USB on the go high speed</description>
         <groupName>USB_OTG_HS</groupName>
         <baseAddress>0x40040E00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x3F200</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>OTG_HS_PCGCR</name>
               <displayName>OTG_HS_PCGCR</displayName>
               <description>Power and clock gating control           register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>STPPCLK</name>
                     <description>Stop PHY clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GATEHCLK</name>
                     <description>Gate HCLK</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PHYSUSP</name>
                     <description>PHY suspended</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DSI</name>
         <description>DSI Host</description>
         <groupName>DSI</groupName>
         <baseAddress>0x40016C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x800</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DSIHOST</name>
            <description>DSI host global interrupt</description>
            <value>98</value>
         </interrupt>
         <registers>
            <register>
               <name>DSI_VR</name>
               <displayName>DSI_VR</displayName>
               <description>DSI Host Version Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x3133302A</resetValue>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the DSI Host</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_CR</name>
               <displayName>DSI_CR</displayName>
               <description>DSI Host Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_CCR</name>
               <displayName>DSI_CCR</displayName>
               <description>DSI HOST Clock Control           Register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXECKDIV</name>
                     <description>TX Escape Clock Division</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TOCKDIV</name>
                     <description>Timeout Clock Division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LVCIDR</name>
               <displayName>DSI_LVCIDR</displayName>
               <description>DSI Host LTDC VCID Register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCID</name>
                     <description>Virtual Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LCOLCR</name>
               <displayName>DSI_LCOLCR</displayName>
               <description>DSI Host LTDC Color Coding           Register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COLC</name>
                     <description>Color Coding</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LPE</name>
                     <description>Loosely Packet Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LPCR</name>
               <displayName>DSI_LPCR</displayName>
               <description>DSI Host LTDC Polarity Configuration           Register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DEP</name>
                     <description>Data Enable Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSP</name>
                     <description>VSYNC Polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSP</name>
                     <description>HSYNC Polarity</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LPMCR</name>
               <displayName>DSI_LPMCR</displayName>
               <description>DSI Host Low-Power mode Configuration           Register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VLPSIZE</name>
                     <description>VACT Largest Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LPSIZE</name>
                     <description>Largest Packet Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_PCR</name>
               <displayName>DSI_PCR</displayName>
               <description>DSI Host Protocol Configuration           Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ETTXE</name>
                     <description>EoTp Transmission Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETRXE</name>
                     <description>EoTp Reception Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BTAE</name>
                     <description>Bus Turn Around Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECCRXE</name>
                     <description>ECC Reception Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCRXE</name>
                     <description>CRC Reception Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_GVCIDR</name>
               <displayName>DSI_GVCIDR</displayName>
               <description>DSI Host Generic VCID Register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VCID</name>
                     <description>Virtual Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_MCR</name>
               <displayName>DSI_MCR</displayName>
               <description>DSI Host mode Configuration           Register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDM</name>
                     <description>Command mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VMCR</name>
               <displayName>DSI_VMCR</displayName>
               <description>DSI Host Video mode Configuration           Register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VMT</name>
                     <description>Video mode Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPVSAE</name>
                     <description>Low-Power Vertical Sync Active               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVBPE</name>
                     <description>Low-power Vertical Back-Porch               Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVFPE</name>
                     <description>Low-power Vertical Front-porch               Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPVAE</name>
                     <description>Low-Power Vertical Active               Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPHBPE</name>
                     <description>Low-Power Horizontal Back-Porch               Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPHFPE</name>
                     <description>Low-Power Horizontal Front-Porch               Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FBTAAE</name>
                     <description>Frame Bus-Turn-Around Acknowledge               Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPCE</name>
                     <description>Low-Power Command Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGE</name>
                     <description>Pattern Generator Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGM</name>
                     <description>Pattern Generator mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGO</name>
                     <description>Pattern Generator               Orientation</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VPCR</name>
               <displayName>DSI_VPCR</displayName>
               <description>DSI Host Video Packet Configuration           Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VPSIZE</name>
                     <description>Video Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VCCR</name>
               <displayName>DSI_VCCR</displayName>
               <description>DSI Host Video Chunks Configuration           Register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NUMC</name>
                     <description>Number of Chunks</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VNPCR</name>
               <displayName>DSI_VNPCR</displayName>
               <description>DSI Host Video Null Packet Configuration           Register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NPSIZE</name>
                     <description>Null Packet Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VHSACR</name>
               <displayName>DSI_VHSACR</displayName>
               <description>DSI Host Video HSA Configuration           Register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSA</name>
                     <description>Horizontal Synchronism Active               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VHBPCR</name>
               <displayName>DSI_VHBPCR</displayName>
               <description>DSI Host Video HBP Configuration           Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HBP</name>
                     <description>Horizontal Back-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VLCR</name>
               <displayName>DSI_VLCR</displayName>
               <description>DSI Host Video Line Configuration           Register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HLINE</name>
                     <description>Horizontal Line duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVSACR</name>
               <displayName>DSI_VVSACR</displayName>
               <description>DSI Host Video VSA Configuration           Register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VSA</name>
                     <description>Vertical Synchronism Active               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVBPCR</name>
               <displayName>DSI_VVBPCR</displayName>
               <description>DSI Host Video VBP Configuration           Register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBP</name>
                     <description>Vertical Back-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVFPCR</name>
               <displayName>DSI_VVFPCR</displayName>
               <description>DSI Host Video VFP Configuration           Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VFP</name>
                     <description>Vertical Front-Porch               duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_VVACR</name>
               <displayName>DSI_VVACR</displayName>
               <description>DSI Host Video VA Configuration           Register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VA</name>
                     <description>Vertical Active duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_LCCR</name>
               <displayName>DSI_LCCR</displayName>
               <description>DSI Host LTDC Command Configuration           Register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDSIZE</name>
                     <description>Command Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
